perf/fibo.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    nginxxnode:
          target: 'http://localhost:5555/node_replicated'
          plugins:
            statsd:
              host: localhost
              port: 8125
              prefix: "artillery-node-replicated"          

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: "Plain Low"
      duration: 30
      arrivalRate: 5
    - name: "Ramp up to Max"
      duration: 15
      arrivalRate: 5
      rampTo: 30
    - name: "Ramp down to Plain High"
      duration: 10
      arrivalRate: 30
      rampTo: 20
    - name: "Plain High"
      duration: 40
      arrivalRate: 20

scenarios:
  - name: fibo (/)
    flow:
      - get:
          url: '/fibo/25'